<template>
<div>
  <navigationBar></navigationBar>
  <div class="searchlayout">
    <div class="searchlayout-content">
      <div class="agree-content-main">
        <h1>iKNOW服务协议</h1><br/>
        <h2>【首部及导言】</h2>
        <p>欢迎您使用iKNOW的服务！</p>
        <p>为使用iKNOW的服务，您应当阅读并遵守《iKNOW服务协议》（以下简称“本协议”）和《iKNOW号码规则》。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、管辖与法律适用条款，以及开通或使用某项服务的单独协议。限制、免责条款可能以黑体加粗或加下划线的形式提示您重点注意。除非您已阅读并接受本协议所有条款，否则您无权使用iKNOW提供的服务。您使用iKNOW的服务即视为您已阅读并同意上述协议的约束。</p>
        <p>如果您未满18周岁，请在法定监护人的陪同下阅读本协议，并特别注意未成年人使用条款。</p>
        <h2>一、【协议的范围】</h2>
        <p> 1.1 本协议是您与iKNOW之间关于用户使用iKNOW相关服务所订立的协议。“iKNOW”是指iKNOW公司及其相关服务可能存在的运营关联单位。“用户”是指使用iKNOW相关服务的使用人，在本协议中更多地称为“您”。</p>
        <p>1.2 本协议项下的服务是指iKNOW向用户提供的包括但不限于即时通讯、网络媒体、互联网增值、互动娱乐、电子商务和广告等产品及服务（以下简称“本服务”）。</p>
        <p>1.3 本协议内容同时包括《iKNOW号码规则》（链接地址：<a>http://zc.iKNOW.com/chs/agreement1_chs.html</a>）和《隐私政策》（链接地址：<a>http://www.iKNOW.com/privacy.html</a>）,且您在使用iKNOW某一特定服务时，该服务可能会另有单独的协议、相关业务规则等（以下统称为“单独协议”）。上述内容一经正式发布，即为本协议不可分割的组成部分，您同样应当遵守。您对前述任何业务规则、单独协议的接受，即视为您对本协议全部的接受。</p>
        <h2>二、【帐号与密码安全】</h2>
        <p>2.1 您在使用iKNOW的服务时可能需要注册一个帐号。关于您使用帐号的具体规则，请遵守《iKNOW号码规则》和单独协议。</p>
        <p>2.2 iKNOW特别提醒您应妥善保管您的帐号和密码。当您使用完毕后，应安全退出。因您保管不善可能导致遭受盗号或密码失窃，责任由您自行承担。</p>
        <h2>三、【用户个人信息保护】</h2>
        <p>3.1 保护用户个人信息是iKNOW的一项基本原则。iKNOW将按照本协议及《隐私政策》（链接地址：<a>http://www.iKNOW.com/privacy.html</a>）的规定收集、使用、储存和分享您的个人信息。本协议对个人信息保护规定的内容与上述《隐私政策》有相冲突的，及本协议对个人信息保护相关内容未作明确规定的，均应以《隐私政策》的内容为准。</p>
        <p>3.2 您在注册帐号或使用本服务的过程中，可能需要填写一些必要的信息。若国家法律法规有特殊规定的，您需要填写真实的身份信息。若您填写的信息不完整，则无法使用本服务或在使用过程中受到限制。</p>
        <p>3.3 一般情况下，您可随时浏览、修改自己提交的信息，但出于安全性和身份识别（如号码申诉服务）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。</p>
        <p>3.4 iKNOW将运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。</p>
        <p>3.5 iKNOW不会将您的个人信息转移或披露给任何非关联的第三方，除非：</p>
        <p>（1）相关法律法规或法院、政府机关要求；</p>
        <p>（2）为完成合并、分立、收购或资产转让而转移；或</p>
        <p>（3）为提供您要求的服务所必需。</p>
        <p>3.6 iKNOW非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用iKNOW的服务前，应事先取得您家长或法定监护人（以下简称"监护人"）的书面同意。</p>
        <h2>四、【使用本服务的方式】</h2>
        <p>4.1 除非您与iKNOW另有约定，您同意本服务仅为您个人非商业性质的使用。</p>
        <p>4.2 您应当通过iKNOW提供或认可的方式使用本服务。您依本协议条款所取得的权利不可转让。</p>
        <h2>五、【知识产权声明】</h2>
        <p>5.1 iKNOW在本服务中提供的内容（包括但不限于网页、文字、图片、音频、视频、图表等）的知识产权归iKNOW所有，用户在使用本服务中所产生的内容的知识产权归用户或相关权利人所有。</p>
        <p>5.2 除另有特别声明外，iKNOW提供本服务时所依托软件的著作权、专利权及其他知识产权均归iKNOW所有。</p>
        <h2>六、【用户违法行为】</h2>
        <p>6.1 您在使用本服务时须遵守法律法规，不得利用本服务从事违法违规行为，包括但不限于：</p>
        <p>（1）发布、传送、传播、储存危害国家安全统一、破坏社会稳定、违反公序良俗、侮辱、诽谤、淫秽、暴力以及任何违反国家法律法规的内容；</p>
        <p>（2）发布、传送、传播、储存侵害他人知识产权、商业秘密等合法权利的内容；</p>
        <p>（3）恶意虚构事实、隐瞒真相以误导、欺骗他人；</p>
        <p>（4）发布、传送、传播广告信息及垃圾信息；</p>
        <p>（5）其他法律法规禁止的行为。</p>
        <p>6.2 如果您违反了本条约定，相关国家机关或机构可能会对您提起诉讼、罚款或采取其他制裁措施，并要求iKNOW给予协助。造成损害的，您应依法予以赔偿，iKNOW不承担任何责任。</p>
        <h2>七、【其他】</h2>
        <p> 如果您对本协议或本服务有意见或建议，可与iKNOW客户服务部门联系（<a>kf.iKNOW.com</a>），我们会给予您必要的帮助。（正文完）</p>
      </div>
    </div>
    <div class="searchlayout-copy">
      2011-2017 &copy; iKNOW
    </div>
  </div>
</div>
</template>

<script>
import navigationBar from '../components/navigationBar'
export default {
  name: 'Agreement',
  data () {
    return {
      agreementcontent: ''
    }
  },
  components: {
    navigationBar
  },
  mounted () {
    this.links()
  },
  methods: {
    links () {
    }
  }
}
</script>

<style>
    .searchlayout{
        border: 1px solid #d7dde4;
        background: #f5f7f9;
    }
    .searchlayout-content{
        min-height: 200px;
        margin: 15px;
        padding: 50px;
        padding-top: 10px;
        padding-bottom:0px;
        overflow: hidden;
        background: #fff;
        border-radius: 4px;
    }
    .agree-content-main{
        padding: 50px;
    }
    .agree-content-main p{
        font-size: 16px;
    }
    .searchlayout-copy{
        text-align: center;
        padding: 10px 0 20px;
        color: #9ea7b4;
    }
</style>
